Revit 2027 API
WorksharedOperationProgressChangedEventArgs.Status Property
 Gets API event status, reflect current operation execution status.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RevitAPIEventStatus Status { get; }
Public ReadOnly Property Status As RevitAPIEventStatus
	Get
public:
property RevitAPIEventStatus Status {
	RevitAPIEventStatus get ();
}
member Status : RevitAPIEventStatus with get
Property Value
RevitAPIEventStatus
See Also
Reference
WorksharedOperationProgressChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace